; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=83, out_folder=htg/blocksworld/training, instance_id=63, seed=2087, goal_proportion=0.1

(define (problem blocksworld-63)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 - object)
 (:init 
    (arm-empty)
    (clear b3)
    (on b3 b7)
    (on b7 b63)
    (on b63 b19)
    (on b19 b55)
    (on b55 b10)
    (on-table b10)
    (clear b79)
    (on b79 b72)
    (on-table b72)
    (clear b51)
    (on b51 b34)
    (on-table b34)
    (clear b70)
    (on b70 b40)
    (on b40 b65)
    (on b65 b31)
    (on b31 b30)
    (on b30 b24)
    (on b24 b47)
    (on b47 b43)
    (on-table b43)
    (clear b68)
    (on b68 b83)
    (on b83 b62)
    (on b62 b76)
    (on b76 b26)
    (on-table b26)
    (clear b74)
    (on b74 b58)
    (on b58 b67)
    (on b67 b54)
    (on b54 b22)
    (on b22 b82)
    (on b82 b42)
    (on-table b42)
    (clear b33)
    (on-table b33)
    (clear b80)
    (on b80 b5)
    (on b5 b18)
    (on b18 b69)
    (on-table b69)
    (clear b8)
    (on b8 b25)
    (on b25 b21)
    (on-table b21)
    (clear b75)
    (on b75 b28)
    (on b28 b37)
    (on b37 b13)
    (on-table b13)
    (clear b56)
    (on b56 b15)
    (on-table b15)
    (clear b27)
    (on b27 b81)
    (on b81 b16)
    (on-table b16)
    (clear b66)
    (on b66 b6)
    (on-table b6)
    (clear b9)
    (on b9 b35)
    (on-table b35)
    (clear b4)
    (on b4 b44)
    (on-table b44)
    (clear b53)
    (on-table b53)
    (clear b64)
    (on b64 b23)
    (on b23 b41)
    (on b41 b36)
    (on-table b36)
    (clear b49)
    (on b49 b48)
    (on b48 b57)
    (on-table b57)
    (clear b59)
    (on-table b59)
    (clear b2)
    (on b2 b61)
    (on b61 b39)
    (on b39 b38)
    (on b38 b50)
    (on b50 b14)
    (on b14 b73)
    (on b73 b45)
    (on b45 b52)
    (on-table b52)
    (clear b77)
    (on b77 b1)
    (on b1 b12)
    (on b12 b78)
    (on-table b78)
    (clear b29)
    (on b29 b11)
    (on b11 b71)
    (on-table b71)
    (clear b46)
    (on b46 b60)
    (on-table b60)
    (clear b20)
    (on b20 b32)
    (on b32 b17)
    (on-table b17))
 (:goal  (and 
    (clear b2)
    (on-table b2)
    (clear b8)
    (on b8 b5)
    (on b5 b7)
    (on b7 b4)
    (on b4 b1)
    (on b1 b3)
    (on b3 b6)
    (on-table b6))))

; plan
1. (unstack b80 b5)
   deleted: (on b80 b5) (clear b80) (arm-empty)
   added: (holding b80) (clear b5)
   goals met: 3 of 10
2. (putdown b80)
   deleted: (holding b80)
   added: (clear b80) (arm-empty) (on-table b80)
   goals met: 3 of 10
3. (unstack b8 b25)
   deleted: (on b8 b25) (clear b8) (arm-empty)
   added: (holding b8) (clear b25)
   goals met: 2 of 10
4. (stack b8 b5)
   deleted: (clear b5) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b5)
   goals met: 4 of 10
5. (unstack b2 b61)
   deleted: (on b2 b61) (clear b2) (arm-empty)
   added: (holding b2) (clear b61)
   goals met: 3 of 10
6. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 5 of 10
7. (unstack b66 b6)
   deleted: (on b66 b6) (clear b66) (arm-empty)
   added: (holding b66) (clear b6)
   goals met: 5 of 10
8. (putdown b66)
   deleted: (holding b66)
   added: (clear b66) (arm-empty) (on-table b66)
   goals met: 5 of 10
9. (unstack b3 b7)
   deleted: (on b3 b7) (clear b3) (arm-empty)
   added: (holding b3) (clear b7)
   goals met: 5 of 10
10. (stack b3 b6)
   deleted: (clear b6) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b6)
   goals met: 6 of 10
11. (unstack b7 b63)
   deleted: (on b7 b63) (clear b7) (arm-empty)
   added: (holding b7) (clear b63)
   goals met: 6 of 10
12. (stack b7 b4)
   deleted: (clear b4) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b4)
   goals met: 7 of 10
13. (unstack b77 b1)
   deleted: (on b77 b1) (clear b77) (arm-empty)
   added: (holding b77) (clear b1)
   goals met: 7 of 10
14. (putdown b77)
   deleted: (holding b77)
   added: (clear b77) (arm-empty) (on-table b77)
   goals met: 7 of 10
15. (unstack b1 b12)
   deleted: (on b1 b12) (clear b1) (arm-empty)
   added: (holding b1) (clear b12)
   goals met: 7 of 10
16. (stack b1 b3)
   deleted: (clear b3) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b3)
   goals met: 8 of 10
17. (unstack b7 b4)
   deleted: (on b7 b4) (clear b7) (arm-empty)
   added: (holding b7) (clear b4)
   goals met: 7 of 10
18. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 7 of 10
19. (unstack b4 b44)
   deleted: (on b4 b44) (clear b4) (arm-empty)
   added: (holding b4) (clear b44)
   goals met: 7 of 10
20. (stack b4 b1)
   deleted: (clear b1) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b1)
   goals met: 8 of 10
21. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 8 of 10
22. (stack b7 b4)
   deleted: (clear b4) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b4)
   goals met: 9 of 10
23. (unstack b8 b5)
   deleted: (on b8 b5) (clear b8) (arm-empty)
   added: (holding b8) (clear b5)
   goals met: 7 of 10
24. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 8 of 10
25. (unstack b5 b18)
   deleted: (on b5 b18) (clear b5) (arm-empty)
   added: (holding b5) (clear b18)
   goals met: 8 of 10
26. (stack b5 b7)
   deleted: (clear b7) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b7)
   goals met: 9 of 10
27. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 8 of 10
28. (stack b8 b5)
   deleted: (clear b5) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b5)
   goals met: 10 of 10
